{
    "id": 42,
    "description": "Given as inputs 3 files, 2 images and a text file, modifies some pixels of the first image, specified in the text file, and saves the new image in the second image, returns the number of pixels modified.",
    "text": "\n    Design and implement the function es42(fImageIn, fcolors,\n    fImageOut) that changes the color of some pixels in an image read\n    from a PNG image file, fImageIn, and then save the modified image in a\n    new PNG image, fImageOut.\n\n    The function also returns the number of pixels of the image whose\n    colors have been changed.  The colors to modify are specified by\n    the text file fcolors: the fcolors file has as many lines as the\n    number of colors to modify.  Each line of fcolors contains 6\n    integers with values between 0 and 255.  Every pixel of the color\n    with the first three integers as color components should be\n    changed with the color with the second three integers as color\n    components.  For example if a line contains the sequence\n    0 0 0 255 255 255, it indicates that in the image all pixels of\n    black color (i.e. color (0,0,0)) must become of white color (i.e.\n    color (255,255,255)).\n\n    NOTE: every pixel should possibly change color only once, namely\n    color replacement should happen only once for each pixel.\n\n    :param fImageIn: name of the PNG file containing the image to edit\n    :param fcolors: name of the text file in which to find the colors to modify\n    :param fImageOut: name of the PNG file in which to save the modified image\n    :return: number of modified pixels\n    ",
    "algorithm": "Load the matrix of the first image\nsave image size\ninitializes a counter for modified pixels\ninitialize an empty dictionary\nopen the text file:\n\tfor each row:\n\t\tsave in the dictionary the key-value pair old_color: new_color\nfor each pixel of the image:\n\tif the pixel is a dictionary key:\n\t\tmodify the pixel\n\t\tincrease the counter\nsave the image\nreturn the counter",
    "tags": ["File", "Images"],
    "effort": 3,
    "clues": [],
    "from": "recupero-19-6-18"
}
