{
    "id": 29,
    "description": "Given two tables having the same structure and the name of a column, with respect to which the tables are ordered, insert in table 1 rows of table 2, returns the number of rows inserted",
    "text": "\nImplement the function es29(table1, table2, col) that takes as an\n    input\n\n    - two tables: table1 and table2, represented by a list of\n      dictionaries and having the same columns\n\n    - a string col with the name of one of the columns of the two\n      tables with respect to which the two tables are sorted in\n      ascending order.\n\n    For all the rows, the values in column col are unique in both\n    table1 and table2.\n\n    The function has to insert in table1 all the rows of table2 that\n    have, in column col, a value not already present in table1\n    (namely, for all the rows of table1, the values in column col\n    remain unique even after the insertions).  At the end, table1 is\n    still orderered with respect to the values of the col column. The\n    function also returns the number of rows inserted in table1.\n\n    For example, if:\n\n    -table1=[{'C1': 1, 'C2': 'x'},\n             {'C1': 3, 'C2': 'a'},\n             {'C1': 4, 'C2': 'a'},\n             {'C1': 5, 'C2': 'a'},\n             {'C1': 7, 'C2': 'b'}],\n\n    -table2=[{'C1': 2, 'C2': 'a'},\n             {'C1': 3, 'C2': 'b'},\n             {'C1': 5, 'C2': 'a'},\n             {'C1': 6, 'C2': 'b'},\n             {'C1': 7, 'C2': 'a'}]\n\n    -col = 'C1'\n\n    the function has to return 2 and table1 changes in\n    table1=[{'C1': 1, 'C2': 'x'},\n            {'C1': 2, 'C2': 'a'},\n            {'C1': 3, 'C2': 'a'},\n            {'C1': 4, 'C2': 'a'},\n            {'C1': 5, 'C2': 'a'},\n            {'C1': 6, 'C2': 'b'},\n            {'C1': 7, 'C2': 'b'}]\n    '''\n   ",
    "algorithm": "Get the number of rows in table1\nI take the values of col in the table1\nfor each row of table2:\n\tif the col value is not in the values taken previously\n\t\tadd the row to table1\norder table1 respect to col\nreturns the difference of the original number of lines with the current number of lines",
    "tags": ["Lists", "Dictionaries", "Sorting"],
    "effort": 4,
    "clues": [],
    "from": "recupero-15-2-18"
}
